var main = [{
   
    right_text: "Elden Ring — компьютерная игра в жанре action/RPG, созданная студией FromSoftware. Игра была анонсирована 9 июня 2019 года и выпущена 25 февраля 2022 года.Руководителем разработки игры является Хидэтака Миядзаки, а американский писатель Джордж Мартин, известный по циклу книг «Песнь Льда и Пламени», выступил консультантом и соавтором сценария.г Elden Ring представляет собой фэнтези в западном духе[4]. Согласно описанию на странице игры на сайте Bandai Namco, действие Elden Ring происходит в Междуземье — стране, которой правит королева Марика Вечная. В прошлом жизнь Междуземья зависела от вынесенного в название игры Кольца Элден, из которого произрастает Мировое древо.",
header:"Elden Ring",
podhead_text:"Так же, в кругах игроков игры поднобного жанра называют Souls играми, т.к. предшественником этой игры были 3 части игры Dark Souls, а Elden Ring является ее прямым продолжением. Игры, выполненные в этом жанре являются крайне сложными в прохождении, и далеко не каждому по силам преодолеть все трудности. Однако, не смотря на сложность и, местами, несправедливость разработчиков, игры подобного плана остаются в “авангарде” игрового сообщества. Люди даже соревнуются между собой: кто-то проходит игру без получения урона, кто-то делает это быстрее всех, а кто-то и вообще проходит игру, используя только стартовое снаряжение. Игра наполнена контентом. Вы можете просто в свое удовольствие исследовать мир, можете испытывать себя в самых жарких битвах насмерть, а можете двигаться по сюжету, открывая для себя эти чудесные места.",
podslider_text:"Одной из отличительных черт части этой серии является верховая езда, которая принесла свежести в геймплей. В игре присутствует система классов, это значит, что рано или поздно придется выбирать, как вы хотите покорять просторы Срединных земель.",
background:"game_back.jpg"


},
{
   
    right_text: "S.T.A.L.K.E.R. 2: Heart of Chornobyl — компьютерная игра в жанре шутера от первого лица с открытым миром, разрабатываемая украинской компанией GSC Game World для Microsoft Windows и Xbox Series X/S. Должна стать очередной игрой серии S.T.A.L.K.E.R.. Как и в предыдущих частях серии, действие S.T.A.L.K.E.R. 2: Heart of Chornobyl происходит в зоне отчуждения Чернобыльской АЭС, куда авантюристы-«сталкеры» проникают в поисках фантастических артефактов, но сталкиваются с мутантами, аномалиями и другими опасностями. Планируется, что игра будет сочетать в себе элементы жанров шутера от первого лица, survival horror и immersive sim, а также предлагать для исследования обширный открытый мир. Игра первоначально была анонсирована в 2010 году и должна была выйти в 2012 году, но этот первоначальный проект был отменён, а команда разработчиков распущена.",
header:"Stalker 2",
podhead_text:"В 2018 году GSC Game World объявила о возобновлении разработки. Выход игры запланирован на 8 декабря 2022 года на Xbox Series X/S и ПК.",
podslider_text:"S.T.A.L.K.E.R. 2: Heart of Chornobyl является шутером от первого лица в открытом мире с элементами survival horror и ролевой игры. Действие игры происходит в постапокалиптической зоне отчуждения Чернобыльской АЭС, где — помимо аварии в 1986 году — в 2006 году произошла вторая катастрофа, в результате которой физические, химические и биологические процессы на данной территории изменились, появилось множество аномалий, артефактов и существ-мутантов.",
background:"stalker_background.png"


},
{
   
    right_text: "Horizon Forbidden West (в России официально издаётся под названием «Horizon Запретный Запад») — компьютерная игра в жанре Action/RPG с открытым миром, разработанная нидерландской студией Guerrilla Games и изданная Sony Interactive Entertainment для игровых приставок PlayStation 4 и PlayStation 5. Дата релиза — 18 февраля 2022 года. Является прямым продолжением игры Horizon Zero Dawn, вышедшей в 2017 году. Horizon Forbidden West является Action/RPG от третьего лица. Главной героиней игры, как и в предыдущей части, является охотница из племени Нора, Элой. Она отправляется на западное побережье бывших США, где столкнётся с новыми угрозами и машинами. Также в анонсирующем трейлере была показана возможность исследования подводного мира и появление Сайленса, одного из центральных персонажей Horizon Zero Dawn.",
header:"Horizon",
podhead_text:"Игра была анонсирована 11 июня 2020 года в рамках презентации игровой консоли PlayStation 5 и игр к ней. В том же месяце руководителем проекта Матийсом де Йонгом было сообщено, что игра планируется к выходу в 2021 году. 16 сентября 2020 года Sony объявила, что игра также будет доступна и для владельцев PlayStation 4. 27 мая 2021 года во время мероприятия State of Play впервые был продемонстрирован геймплей игры. 9 декабря 2021 года во время церемонии The Game Awards 2021 был представлен новый трейлер, в котором были показаны элементы игрового процесса, в том числе новые машины и костюмы Элой. 27 января 2022 года студия Guerrilla Games объявила о завершении разработки и отправки игры в печать.",
podslider_text:"Главная особенность Forbidden West — в том, насколько плотно тут запакован контент. Мир вроде бы открытый, но не совсем: почти все сюжетные маршруты сделаны таким образом, чтобы игрок примерно раз в несколько минут натыкался на интересное задание — будь то новый тип машин, сайд-миссия, руины старого мира или очередной длинношей для открытия карты.",
background:"stalker_background.png"


}
]


var imgArr1 = new Array();

imgArr1[0]= new Image();
imgArr1[0].src='elden_header.jpg';

imgArr1[1]= new Image();
imgArr1[1].src='marks_elden.png';

imgArr1[2]= new Image();
imgArr1[2].src='right_elden.jpg';

imgArr1[3]= new Image();
imgArr1[3].src='elden.mp4';

imgArr1[4]= new Image();
imgArr1[4].src='dk.jpg';

imgArr1[5]= new Image();
imgArr1[5].src='./bd.jpg';

imgArr1[6]= new Image();
imgArr1[6].src='./sk.jpg';

imgArr1[7]= new Image();
imgArr1[7].src='image1_elden.jpg';

imgArr1[8]= new Image();
imgArr1[8].src='image2_elden.jpg';

imgArr1[9]= new Image();
imgArr1[9].src='image3_elden.jpg';



var imgArr2 = new Array();

imgArr2[0]= new Image();
imgArr2[0].src='stalker_header.jpg';

imgArr2[1]= new Image();
imgArr2[1].src='stalker_marks.jpg';

imgArr2[2]= new Image();
imgArr2[2].src='right_stalker.png';

imgArr2[3]= new Image();
imgArr2[3].src='stalker.mp4';

imgArr2[4]= new Image();
imgArr2[4].src='./me.png';

imgArr2[5]= new Image();
imgArr2[5].src='./sr.jpg';

imgArr2[6]= new Image();
imgArr2[6].src='./rust.jpg';

imgArr2[7]= new Image();
imgArr2[7].src='image1_stalker.png';

imgArr2[8]= new Image();
imgArr2[8].src='image2_stalker.png';

imgArr2[9]= new Image();
imgArr2[9].src='image3_stalker.png';




var imgArr3 = new Array();

imgArr3[0]= new Image();
imgArr3[0].src='horizon_header.jpg';

imgArr3[1]= new Image();
imgArr3[1].src='horizon_osenki.jpg';

imgArr3[2]= new Image();
imgArr3[2].src='right_horizon.jpg';

imgArr3[3]= new Image();
imgArr3[3].src='horizon.mp4';

imgArr3[4]= new Image();
imgArr3[4].src='hz.png';

imgArr3[5]= new Image();
imgArr3[5].src='mh.png';

imgArr3[6]= new Image();
imgArr3[6].src='u.png';

imgArr3[7]= new Image();
imgArr3[7].src='image1_horizon.png';

imgArr3[8]= new Image();
imgArr3[8].src='image2_horizon.png';

imgArr3[9]= new Image();
imgArr3[9].src='image3_horizon.png';
